Autodesk.Revit.DB.Structure.ToleranceParam.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ToleranceParam.Type
Since:
2026.1

Autodesk.Revit.DB.Structure.ToleranceParam.Max
Since:
2026.1

Autodesk.Revit.DB.Structure.ToleranceParam.Min
Since:
2026.1

Autodesk.Revit.DB.Structure.ToleranceParam.Value
Since:
2026.1

Autodesk.Revit.DB.Structure.ToleranceParam.#ctor(System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.ToleranceType)
Creates a new instance of ToleranceParam.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026.1

Autodesk.Revit.DB.Structure.ToleranceParam
This class describes the tolerance parameter.
Since:
2026.1